
<template>
    <div>
        <forms :questions="lifestylepersonalitytest"/>
        <div class="box"><button @click="result()" class="button is-large is-success is-light">내 검사 결과 확인하기!</button></div>
    </div>
</template>
<script>
    import router from '@/router';
    const surveys = [
                { index: 1, img: 'eating-delicious-food.png', question: '맛있는 음식을 먹을 때', answers: [ '사진 찍어서 인스타그램에 올리고 있음', '맛있어서 속으로 기뻐함' ], score: ["EF", "IN"]},
                { index: 2, img: 'anger.png', question: '나의 분노 유형은?', answers: [ '화산폭발형', '얼음왕국 엘사편', '수도꼭지형' ], score: ["EP", "ITJ", "FP"]},
                { index: 3, img: 'baby-crying.png', question: '아이가 울 때 나의 대처법은?', answers: [ '아이 앞에서 온갖 재롱을 부린다', '에고 속상해서 그랬구나(토닥토닥)', '무시' ], score: ["EFP", "IF", "IT"]},
                { index: 4, img: 'night-smartphone.png', question: '하루를 마무리하는 나의 모습은?', answers: [ '오늘의 계획 완료. 내일 계획 세운다', '유튜브짱, 넷플릭스 존잼', '그냥 잔다' ], score: ["IJ", "FP", "STP"] },
                { index: 5, img: 'shoelace-tying.jpg', question: '친구 신발 끈이 풀렸을 때', answers: [ '모른척 한다', '신발끈을 대신 묶어준다', '남은 한쪽 끈도 푼다' ], score: ["INT", "FJ", "ET"] },
                { index: 6, img: 'students.jpg', question: '학교에서 나의 행동 유형은', answers: [ '분위기 메이커', '늘 선행상 받음', '조용히 중간만 함' ], score: ["EF", "IJ", "IP"]},
                { index: 7, img: 'wondering-man.jpg', question: '화나는 일이 있을 때 나의 행동은?', answers: [ '내적 손절', '한 번 더 참아봄', '할 말 다 함' ], score: ["ST", "SF", "NT"]},
                { index: 8, img: 'anger2.png', question: '불합리한 상황에서 나의 대처법', answers: [ '비켜 다 뒤집을거니까', '좀 더 평화로운 방법은 없을까', '좀 더 참아봐 기달리면 달라질 수도' ], score: ["TJ", "FP", "ST"]},
                { index: 9, img: 'say-friends.png', question: '친구와 대화할 때 내가 자주 하는 말', answers: [ '헉,진짜? 대박!', '아..ㅎㅎㅎ', '말을 안 함' ], score: ["EF", "IF", "ST"] },
                { index: 10, img: 'talking-together.jpg', question: '누가 내 뒷담했을 때 나의 대처는?', answers: [ '세상 우울함', '걔가 누군데?', '신경 안 써~(엄청 신경씀)' ], score: ["FP", "ST", "EF"]}
                ]
    export default {
        data() {
            return {
            lifestylepersonalitytest: surveys,
            }
        },
        methods: {
            result() {
                const results = [ 
                    { index: "ISTJ", name: "소금형(ISTJ)", desc: '사실과 근거에 집중하여 꼼꼼한 유형\n매사 철저하게 행동하며 종사하는 곳에서 핵심적인 역할을 가지고 있음', feature: "원리원칙적, 계획적.\n여행가면 나서서 계획 세움.\n즉흥적인거 싫어함 약속 어기는거 싫어함.\n협동하기 싫어함.\n그냥 나 혼자 하는게 젤 편하고 젤 빠름.\n누가 도와준다고 해도 혼자 할 수 있음 혼자 함.\n내 일이랑 의견에 간섭받는 거 싫어함.\n남한테 관심 별로 없는 편.\n내 얘기 하는것도 싫고 남 얘기 들어주는 것도 힘듦 내가 왜 듣고있어야 하는지 모르겠음.\n책임감 많음.\n가끔 공감능력 부족한 거 같다는 소리 들음.\n딱딱하단 소리 자주 들음.\n철벽 잘 침.\n프로젝트 할 때 이야기 딴 곳으로 새는 거 매우 싫어함. 시작했으면 목표한 거 끝내야함.\n시작했으면 목표한거 끝내야함.\n"},
                    { index: "ESTJ", name: "사업가형(ESTJ) : 엄격한 관리자", desc: '모든 일을 계획적으로 잡고 실행하는 것을 좋아하는 유형\n목표를 위해 열정과 노력을 마다하지 않음', feature: "고집 셈, 현실적, 이성적, 직설적.\n호불호 확실.\n사람 많은거 싫어함.\n리더 맡는 거 싫어하는데 막상 하면 잘함.\n나가서 노는것보단 이것저것 배우는게 좋음.\n외로움 별로 안탐.\n싸우는 거 싫어하지만 싸워서 지는거 싫어함.\n일처리 못하는 거 세상에서 제일 싫음.\n시간약속 어기는 거 싫고 즉흥적인거 싫음.\n남에게 관심없고 오로지 나한테만 집중.\n목표 설정해놓고 그 목표 이룰때까지 한 우물만 팜.\n사람들이 아는 내 성격이랑 혼자 있을 때랑 조금 다름.\n모든게 제자리에 있어야 하고 내 계획이 절대 틀어지면 안됨.\n뭐든 확실한 게 좋음.\n리더역할 주도적으로 자주 함.\n누가 일 못하는 거 못 보고 차라리 그럴바에 내가 두세배로 일 다 해놓음.\n공감능력 부족.\n"},
                    { index: "ESFJ", name: "친선도모형(ESFJ) : 사교적인 외교관", desc: "타인과의 관계에 신경을 많이 쓰는 사람\n인정받는 것에 굉장히 민감함\n사람과의 교감을 중요시함", feature: "생각보다 철저함.\n혼자 계획 세우고 그 계획 틀어지는 거 싫어함.\n술자리 좋아함.\n남 눈치 많이 봄.\n책 읽고 영화보는 거 좋아함.\n상담, 고민 들어주는 거 잘함.\n친구, 가족 내 주변 인물들 다 챙김.\n인간관계에서 상처받아도 그 사람 배려한다고 얘기 못함.\n어디 나가면 어색한거 못 참고 먼저 말 걺."},
                    { index: "ISTP", name: "백과사전형(ISTP) : 만능 재주꾼", desc: "조용하지만 관찰력이 뛰어난 성격의 유형\n만드는 것과 도구를 다루는 것에 관심이 많음\n판단력이 매우 빠름", feature: "만사가 귀찮음.\n무미건조, 낯가림 근데 친해지면 말 많고 장난도 잘 침.\n새로운 사람 만나는거 싫어함.\n남한테 관심 없고 내 얘기도 잘 안함.\n혼자만의 문화생활 즐김.\n쓸데없는 소비 엄청함.\n노력절약형, 효율적인거 개 좋아함.\n망상 잘 함.\n내가 제일 잘난줄 암.\n카톡 할말없으면 읽씹, 대화 이어가기 안함.\n주류에 속하기 싫어함.\n자기자랑 꼴뵈기 싫음.\n이것저것 공부하고 싶은게 너무 많음 근데 끝을 못봄.\n미루고 미루다 발등에 불떨어져도 안하다가 발등 타들어가면 그제야 함.\n기계조작 잘하고 재미있어함.\n하나에 꽂히면 끝장을 봐야함.\n내가 질릴때까지 관심있고 하고싶은 것만 함.\n하기싫은건 죽어도 안 함.\n내가 맡은 바는 다 함.\n위계질서 개싫어하고 내가 하는거 간섭 받는거 싫어함.\n친하면 활발한데 내 사람 아니면 입 꾹 다물고 있음.\n관종이라 관심받는건 좋은데 시끄러운건 싫어함.\n누가 내 욕해도 별로 신경 안씀.\n관찰력 뛰어남, 멀티 안됨, 호불호 강함.\n공감능력 부족.\n티 안 내려고 노력은 하는데 그래도 티 남.\nMBTI, 사주, 타로 관심많음.\n청소 안함."},
                    { index: "ISFP", name: "성인군자형(ISFP) : 호기심 많은 예술가", desc: "호기심이 강하며 자율적이고 융통적인 성격\n임기응변에 강하고 다양한 삶을 선호함", feature: "귀찮음, 행동 느림.\n감정기복 심하고 공감능력 좋음.\n모든 일 미룰 수 있을 때까지 다 미룸.\n집순이, 집돌이.\n집에가면 연락두절됨.\n배려형 개인주의\n약속 있었는데 취소되면 속으로 기뻐함.\n혼자가 좋은데 막상 만나면 잘 놈, 노는건 좋지만 금방 지침.\n조용한 관종, 소심한 관종.\n칭찬 받으면 그거 하루종일 생각남.\n갈등, 불화 싫어함.\n다이어리 끝까지 써본 적 없음.\n사람들이랑 만나면 기빨림.\n한번 받은 일은 끝까지 해야한다는 생각이 있음 근데 하다가 잠.\n친해지면 활발함.\n남 눈치 존나 많이 봄.\n하기 싫은거 안하고 하고싶은것만 함.\n착한 줄 아는데 사실 이기적.\n고집, 자존심 진짜 셈.\n남한테 속마음 얘기 잘 안함.\n사람 만나는거 좋은데 싫음.\n결정 잘 못함.\n거절을 잘 못함.\n양보를 잘함.\n분석, 비판, 판단은 잘하는데 이러한 판단을 적극적으로 행동에 옮기지는 않음.\n미룰 수 있을때까지 미룸.\n겸손하다는 말 자주 들음.\n낙천적.\n인간관계에 신경 많이 쓰는 편.\n자존감 낮음.\n주변 의견, 주변 분위기 따라감.\n불평불만 다 쌓아두기만하고 표출은 못함."},
                    { index: "ESTP", name: "활동가형(ESTP) : 모험을 즐기는 사업가", desc: "직관력이 뛰어나며 스스로의 역량을 믿어\n자신감 넘치게 모든 일을 수행함", feature: " 외로움 잘 탐.\n손재주 좋음.\n리더쉽 있음.\n표현을 많이 함.\n어른들이 좋아함.\n밖에서 사람 만나는거 좋아하지만 게을러서 나가기까지가 싫음.\n하고싶은거 다 해야됨 못하면 혼자서 부들부들하다가 곧 까먹음.\n걍 대충살고 눈치도 안봄.\n스트레스도 잘 안받음 근데 그렇게 적극적인 편도 아님 걍 사는대로 삼.\n공감능력 조금 부족.\n남한테 관심 없고 생각하는것도 귀찮음.\n모임에서 어느새 내가 분위기 주도하고 있음.\n근자감 쩔음."},
                    { index: "ESFP", name: "사교형(ESFP) : 자유로운 영혼의 연예인", desc: "타인과의 관계를 중요시 여기기에\n이들에게 친절하고, 원만한 관계를 유지함\n즉흥적이고 에너지가 넘치는 것이 특징", feature: "성격 매우 급함.\n우주최강오지랖.\n생각없이 잘삼.\n아무리 걱정되는 일 있어도 좀만 지나면 무생각.\n하고싶다고 생각한거 다 해야됨 근데 하기싫은건 끝까지 미룸.\n고집 셈.\n혼자 있으면 지루해서 뭔갈 계속 하고 있어햐 함.\n모임장소에서 침묵 흐르는거 제일 싫어함.\n사람의 단점보단 장점을 보려하고 싸움보단 평화가 좋음.\n사교성 좋음.\n자존감 높음.\n모든게 내 위주.\n사람 너무 좋고 어울리는 거 좋은데 집밖에 나가기 귀찮음."},
                    { index: "ISTJ", name: "소금형(ISTJ) : 청렴결백한 논리주의자", desc: "사실과 근거에 집중하여 꼼꼼한 유형\n매사 철저하게 행동하며 종사하는 곳에서 핵심적인 역할을 가지고 있음", feature: "원리원칙적, 계획적.\n여행가면 나서서 계획 세움.\n즉흥적인거 싫어함 약속 어기는거 싫어함.\n협동하기 싫어함.\n그냥 나 혼자 하는게 젤 편하고 젤 빠름.\n누가 도와준다고 해도 혼자 할 수 있음 혼자 함.\n내 일이랑 의견에 간섭받는 거 싫어함.\n남한테 관심 별로 없는 편.\n내 얘기 하는것도 싫고 남 얘기 들어주는 것도 힘듦 내가 왜 듣고있어야 하는지 모르겠음.\n책임감 많음.\n가끔 공감능력 부족한 거 같다는 소리 들음.\n딱딱하단 소리 자주 들음.\n철벽 잘 침.\n프로젝트 할 때 이야기 딴 곳으로 새는 거 매우 싫어함. 시작했으면 목표한 거 끝내야함.\n시작했으면 목표한거 끝내야함."},
                    { index: "ISFJ", name: "권력형(ISFJ) : 용감한 수호자", desc: "차분한 성격으로 사람들과\n우호적인 관계를 가지는 유형", feature: "침착하게 갈등 상황에 대응하려 함\n원칙주의자.\n남 눈치봄, 남들 챙기는 거 좋아함.\n외로움 많이 타는데 많은 사람이랑 있는건 싫음.\n아싸무리에서 인싸, 인싸무리에서 아싸.\n전화오면 받을까 말까 고민하다 받음.\n게으른 완벽주의자.\n조 짜서 하는 단체활동 안 좋아함 혼자서 할 수 있는 일 좋아함.\n남이 볼땐 인생 노잼처럼 보이지만 자기선에선 매우 만족하며 삶.\n배려심 많고 공감 잘해줌.\n인간관계에 스트레서 많이 받음.\n아니면 아니고 말면 말자 마인드.\n겉으론 무덤덤해보여도 속으론 온갖 생각 다 함.\n살짝 비판적.\n어쩔 땐 내향적이고 어쩔 땐 외향적, 성격 왔다갔다해서 나도 내 성격 잘 모름.\n겸손하고 칭찬 많이 해줌.\n진짜 싫어하는 사람 아니면 잘 안까고 남한테 관심도 별로 없음.\n성격 온화, 하자고 하면 거의 다 해줌.\n계획 세우는 거 좋아하고 메모하고 기억해둠.\n사람들한테 나에 대한 어필 잘 안함.\n나서는 거 싫어하는데 관심 받는건 좋음.\n사람들과 어울리는거 좋아하는데 그만큼 혼자 노는것도 좋음.\n되게 쓸데없는 것까지 신경씀 근데 또 쿨함.\n애인 사귀면 오래감."},
                    { index: "ESTJ", name: "사업가형(ESTJ) : 엄격한 관리자", desc: "모든 일을 계획적으로 잡고 실행하는 것을 좋아하는 유형\n목표를 위해 열정과 노력을 마다하지 않음", feature: "고집 셈, 현실적, 이성적, 직설적.\n호불호 확실.\n사람 많은거 싫어함.\n리더 맡는 거 싫어하는데 막상 하면 잘함.\n나가서 노는것보단 이것저것 배우는게 좋음.\n외로움 별로 안탐.\n싸우는 거 싫어하지만 싸워서 지는거 싫어함.\n일처리 못하는 거 세상에서 제일 싫음.\n시간약속 어기는 거 싫고 즉흥적인거 싫음.\n남에게 관심없고 오로지 나한테만 집중.\n목표 설정해놓고 그 목표 이룰때까지 한 우물만 팜.\n사람들이 아는 내 성격이랑 혼자 있을 때랑 조금 다름.\n모든게 제자리에 있어야 하고 내 계획이 절대 틀어지면 안됨.\n뭐든 확실한 게 좋음.\n리더역할 주도적으로 자주 함.\n누가 일 못하는 거 못 보고 차라리 그럴바에 내가 두세배로 일 다 해놓음.\n공감능력 부족."},
                    { index: "ESFJ", name: "친선도모형(ESFJ) : 사교적인 외교관", desc: "타인과의 관계에 신경을 많이 쓰는 사람\n인정받는 것에 굉장히 민감함\n사람과의 교감을 중요시함", feature: "생각보다 철저함.\n혼자 계획 세우고 그 계획 틀어지는 거 싫어함.\n술자리 좋아함.\n남 눈치 많이 봄.\n책 읽고 영화보는 거 좋아함.\n상담, 고민 들어주는 거 잘함.\n친구, 가족 내 주변 인물들 다 챙김.\n인간관계에서 상처받아도 그 사람 배려한다고 얘기 못함.\n어디 나가면 어색한거 못 참고 먼저 말 걺."},
                    { index: "INFJ", name: "예언자형(INFJ) : 선의의 옹호자", desc: "통찰력이 높고 섬세한 언어 표현을 함\n공동체 생활을 중요시 여김", feature: "생각이 너무 많음.\n새로운 일 시작하는거, 새로운 사람 만나는거 싫어함.\n낯가림 심함, 눈치 빠름.\n겉으로 웃는데 속으로 욕 많이 함.\n집순인데 여행가는 건 좋음.\n할거 미리 해치우는 편.\n친해지고 싶은 사람이 있어도 그 사람이 먼저 다가와주길 바람.\n관심받고 싶은데 나서는 건 싫어함.\n내사람한테는 존나 잘해줌.\n조용히 다니는데 가끔 좀 튀고싶을 때 있음.\n나 혼자 생각할 시간 꼭 필요.\n계획적인거 좋아함.\n친하고 마음 맞는 애랑 단 둘이 노는거 좋아함.\n내가 하고싶은건 열심히 함 특히 예술쪽으로 감수성 풍부."},
                    { index: "INFP", name: "잔다르크형(INFP) : 열정적인 중재자", desc: "이타적인 성격을 가진 유형\n타인의 감정을 세심하게 살피며 열정적임", feature: "성격이론에 관심 많고, 커뮤니티 많이 함.\n이상주의적.\n잡생각 많음 (망상 잦음).\n관종인데 막상 관심받으면 어색하고 어쩔줄모름.\n완벽하게 하지 못할거면 아예 시작을 안함.\n해야될 일 생각만 하고 실제로는 발만 담그고 안 함.\n완전 처음 보는 사람한테는 말 잘 거는데 학교같이 조직생활 하는 곳에서는 낯 엄청 가림.\n좋아하는 건 미친 듯이 파고 집중 근데 열정이 초기에만 불타고 빨리 식음.\n너무 게을러서 벼락치기 함.\n멀티 안됨, 연락 귀찮아함, 안읽씹 잘함.\n내적 성장 엄청 중요하게 여김.\n가끔 우울한 나에 심취 내 개인적인 얘기 남들한테 하는거 싫어함.\n화날 때 혼자 있어야 함 누가 건들면 안됨.\n한번 싫은건 끝까지 싫음.\n남한테 정말 관심 없음, 남을 잘 안믿음.\n남이 나를 어떻게 생각할지 고민 많이 함.\n누가 내 일하는 방식에 대해 간섭하면 매우 싫어함.\n혼자 있는건 좋은데 외로운 건 싫음.\n나가는거 귀찮아하는데 막상 나가면 잘놈.\n집에서 뒹굴거리면서 티비보는거 좋아함.\n여러명이서 노는것보다 한두명이서 노는게 좋음.\n싸우는 거 싫어해서 걍 내가 희생.\n인간관계에  예민함.\n자기애 강한데 자존감은 낮음.\n처음 보는 사이면 먼저 말 못걸음 근데 말 걸면 또 잘 얘기함.\n남얘기 잘 들어주는척 하는데 사실 딴생각함.\n남얘기에 큰 관심없고 공감하고 싶은 마음도 없음.\n시작은 창대하나, 정작 끝을 내는 법은 없음.\n생각만 하고 실천 안함.\n남한테 폐끼치는 거 제일 싫어함.\n낯 심하게 가리고 사람 사귈 때 따지는거 존나 많음."},
                    { index: "ENFJ", name: "언변능숙형(ENFJ) : 정의로운 사회운동가", desc: "청중둘을 압도하는 영향력을 가진 사람\n정의로운 사회운동가형을 가짐", feature: "시끄러움.\n핵인싸 되고싶어함.\n사람들을 이끄는 것에 타고난 기질이 있고 좋아하기도 함.\n사람을 되게 좋아함.\n상대방도 본인을 신뢰한다는 느낌을 받으면 살아있음을 느낌.\n단순함.\n멘탈 강함.\n무리에 속해있는 것도 좋아하지만 마이웨이 기질 약간 있음.\n여가시간 혼자 보내는거 좋아함.\n많은 사람들의 신뢰를 받는 성격.\n사람들한테 잘 맞춰주는 성격.\n객관적, 직관적 내가 스스로를 잘 앎 일에 흥미가 많은 사람이라 꿈이 여러개.\n센스있고 눈치가 빠름.\n계획짜는거 좋아함.\n남들 눈치봄 남들 신경쓰고 잘해주려하는데 그만큼 상처도 받음."},
                    { index: "ENFP", name: "스파크형(ENFP) : 재기 발랄한 활동가", desc: "창의적이며 활발한 성격을 지님\n상상력이 풍부하며 사고가 자유로움", feature: "정신산만함, 생각 많음, 고집 셈.\n일머리 있음.\n흥미있고 관심있는건 열정적 그러나 관심 없는건 별로 알고 싶어하지도 않음.\n매번 나서서 무얼 하진 않는데 아무도 안나서면 답답해서 나서는 스타일.\n낯을 좀 가리는데 풀리면 금방 친해지고 말도 많아짐.\n얘기하는 거 좋아함.\n무언가에 쉽게 몰두했다 쉽게 그만둠.\n남 얘기에 리액션을 잘 해줘서 고민상담 하는 애들 많음.\n거짓말 잘 못해서 입에 발린 말 잘 못함.\n하루에 행복한 일 하나씩 정해놓고 설레함.\n친구들이랑 얘기하는거 좋아함.\n새롭게 친구 사귀는 거 좋아함.\n감정기복 심함.\n감정 얼굴에 다 드러나는 편.\n무계획, 즉흥적인 편.\n내가 하고싶은거 꼭 해야함.\n저금 잘 안함."},
                    { index: "INTJ", name: "과학자형(INTJ) : 용의주도한 전략가", desc: "철저한 계획을 세우며 독립적인 성향을 가짐", feature: "혼자있는거 좋아함, 사회활동 싫어함.\n근데 단체활동할 때 주도적인 역할 자주 맡음.\n사람많고 시끄러운 장소 싫어함.\n굉장한 개인주의자, 이기적.\n하루하루 세세하게 계획짜놓고 지내는 것 좋아함.\n돈관리도 잘 하는 편, 사실과 원리원칙 중요.\n감정에 휘둘리는 거 싫어함.\n남에게 관심 없고 친구가 고민 상담할때도 공감 못함.\n문제 해결에 도움은 줘도 위로 자체는 잘 못함.\n공상 잦음, 어떤 사안이나 작품에 대해 다각도로 해석하는 거 좋아함.\n수다 떠는 거 좋아함.\n인간관계 정리 잘 하고 사람에게 정 붙이는데 시간 오래 걸림.\n사람 얼굴, 이름 잘 기억 못함.\n약간 관종끼 있지만 내성적이라 표출은 안함.\n동물들에게는 한없이 친절.\n완벽주의자.\n몇몇 물건에 집착함.\n무신경하다는 소리 들음.\n이성적인데 감성적.\n성격 이상하다는 생각 스스로 자주 함.\n특이하고 특별한데 남에게 그런소리 듣는 건 싫음.\n남 눈치 안보고 남 일에 무신경."},
                    { index: "INTP", name: "아이디어형(INTP) : 논리적인 사색가", desc: "혁신적 인물형으로 지적 호기심을 가짐\n늘 새로운 지식을 추구하는 인물", feature: "자발적 아웃사이더.\n혼자 있는게 제일 편하고 행복.\n나 존나 잘난줄 암.\n공상 자주함.\n분석, 추리 좋아함, 생각 많음.\n무뚝뚝한 편이고 잡담같은것도 잘 못하고 싫어함.\n논리력 부족한, 어리석은 사람들 보면 화가 너무 남.\n책 진짜 좋아하는데 읽기 귀찮아서 리스트에만 적어놓음.\n지식에 대한 욕망 강함.\n인간은 싫지만 흥미로운 존재라고 생각.\n진지충이라는 소리 자주 들음.\n팩폭 하지말라는 소리 자주 들음.\n주변에 사람들 별로 없는데 남아있는 사람들이랑은 정말 잘 지냄.\n감수성 풍부, 말 많이 안함, 귀찮은거 싫어함.\n존나 게으르고 미루기의 끝판왕.\n시끄러운거 존나 싫어함.\n감정기복 없음.\n누구한테 내 감정 잘 표현 안하고 묵혀두는데 딱히 그거에 스트레스 받진 않음.\n웬만한 일에 상처 안받음.\n남이 내 욕하는거 신경 안쓰고 남 욕도 안함.\n인간관계 계산적.\n친구들이랑 얘기할 때 가벼운 얘기하는거 싫어함.\n시작하면 끝을 봐야함.\n개인주의자 완벽하게 못할거면 안함.\n남에게 피해주는 거 싫어하고 남에게 관심 별로 없음.\n자기주관 뚜렷, 호불호 확실 감수성 풍부."},
                    { index: "ENTJ", name: "지도자형(ENTJ) : 대담한 통솔자", desc: "철저하면서도 단호한 성격을 가짐\n결단력과 통솔력이 뛰어난 리더형 인물", feature: "팀플하면 결국 총대매고 내가 함.\n누구한테 의존하거나 의지하는 스타일 아님.\n오직 세상에 믿을 사람은 나 하나.\n열등감 느낀적 극히 드뭄.\n피해 주는거, 피해 받는거 싫어하고 남 일에 노관심.\n남이 이래라 저래라 하는거 싫어하고 냉철해질땐 끝도 없이 냉철해짐.\n성격 불도저 같은 경향.\n자기애 강함.\n감정적 공감 안됨.\n내 일은 내 일 니 일은 니 일.\n친구들이 하소연해도 공감이 아니라 해결책 찾아줌.\n새로운 사람 만나는 거 좋아하지만 인간과 깊은 관계맺는건 별로 안좋아함.\n머릿속에서 시뮬레이션 다 해보고 해결책 찾아가는 쪽.\n현실적, 논리적 근데 혼자있을 땐 상상력 개오져짐.\n사람많을 땐 프로페셔널한 정상인, 혼자있을 땐 몽상가."},
                    { index: "ENTP", name: "발명가형(ENTP) : 논쟁을 즐기는 변론가", desc: "끊임없이 새로운 것을 시도하며 도전적인 자세를 즐김\n활동적인 것을 좋아하며 변화를 두려워하지 않음", feature: "혼자서 돌아다니는게 제일 편함.\n독립심 강함.\n탐욕적, 자존심, 고집 셈, 냉철함.\n겉으론 인싸 속모습은 아싸.\n나한테 잘해주는 사람은 두 배로 잘해주는데 나한테 못해주면 걍 1도 없음.\n밖에 놀러가면 진짜 잘 노는데 집 안에 있는것도 좋음.\n변덕 심함, 자기애 강함.\n직설적이고 솔직하게 내 맘을 표현하는 것에 거리낌이 없음.\n다른 사람들 일에 관심없고 다른 사람들이 나를 어떻게 생각하는지도 별 관심없음.\n지나간 일에 후회가 없음, 그래서 힘든 일 있어도 빨리 털어내는 편.\n자기합리화랑 포기 존나 잘하고 뒷일 생각 안하고 지금 내가 하고싶은대로 다 하면서 삼.\n감정기복 심함, 남들한테 기분 바뀌는거 다 티냄.\n사람한테 가장 힐링받고 사람한테 가장 스트레스 받음.\n좋아하는 사람 싫어하는 사람 명확히 구분됨.\n뒷심부족.\n혼자 있는거 좋아하는데 외로움 탐.\n뭐 하나에 꽂히면 그것만 함 질리면 아예안함.\n정해진 틀에 갇힌 생활 못함, 반복되는 일 매우 싫어함.\n잘못된거 잘못됐다고 말해야함.\n이기적으로 사는데 이기적인거 안싫어함.\n다방면에 적당한 재능, 근데 다 잘하는데 엄청 잘하진 않음.\n과정보다 결과 중요.\n사람들과 지내는거 좋아하고 친화력 좋고 외향적인데 혼자만의 시간도 필요함.\n손재주 있음."}
                ]
                var MBTI = [0, 0, 0, 0, 0, 0, 0, 0];  // E,I,S,N,T,F,J,P
                var result = "";
                var res = "";
                var verify = 0;
                for (var i = 0; i < surveys.length; i++) {
                    for (var j = 0; j < surveys[i].answers.length; j++) {
                        var subject = String(i+1) + (j+1)
                        if (document.getElementById(subject).checked == true) {
                            res += surveys[i].score[j];
                            verify += 1;
                        }
                    }
                }
                if (verify != surveys.length) {
                    alert("아직 선택 안한 게 있어요.. 선택해주세요")
                    return;
                }
                
                var char = res.split("");

                for(var i = 0; i < res.length ; i++) {
                if(char[i] === "E")
                    MBTI[0] += 1;
                if(char[i] === "I")
                    MBTI[1] += 1;
                if(char[i] === "S")
                    MBTI[2] += 1;
                if(char[i] === "N")
                    MBTI[3] += 1;
                if(char[i] === "T")
                    MBTI[4] += 1;
                if(char[i] === "F")
                    MBTI[5] += 1;
                if(char[i] === "J")
                    MBTI[6] += 1;
                if(char[i] === "P"){
                    MBTI[7] += 1;
                }
                }
                if(MBTI[0] >= MBTI[1]) result += "E";
                else result += "I" ;
                if(MBTI[2] >= MBTI[3]) result += "S";
                else result += "N" ;
                if(MBTI[4] >= MBTI[5]) result += "T";
                else result += "F" ;
                if(MBTI[6] >= MBTI[7]) result += "J";
                else result += "P" ;

                let idx = 0;
                for (var i = 0; i < 16; i++) {
                    if (result === results[i].index) {
                        idx = i;
                    }
                }
                router.push({name: "results", params:{is: "lifestyle-personality-test", name: result, id: results[idx].name, desc: results[idx].desc, feature: results[idx].feature}});
        },
    }}
</script>